---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalLinkType
source: html/81f029eb-deab-5e88-7d08-6cf41995d84a.htm
---
# AnalyticalLinkType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.